
#### Terraform Format and Style 🖌`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📋`success`

<details><summary>Show Plan</summary>

```hcl
data.scaleway_container_namespace.portfolio: Reading...
data.scaleway_container_namespace.portfolio: Read complete after 1s [id=fr-par/cc7ff8cc-65f0-4559-ba8d-42e9297c9158]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # scaleway_container.portfolio_app will be created
  + resource "scaleway_container" "portfolio_app" {
      + cpu_limit             = 1000
      + cron_status           = (known after apply)
      + deploy                = false
      + domain_name           = (known after apply)
      + environment_variables = (known after apply)
      + error_message         = (known after apply)
      + http_option           = "enabled"
      + id                    = (known after apply)
      + local_storage_limit   = (known after apply)
      + max_concurrency       = (known after apply)
      + max_scale             = 1
      + memory_limit          = 128
      + min_scale             = 0
      + name                  = "clercq-it-app"
      + namespace_id          = "fr-par/cc7ff8cc-65f0-4559-ba8d-42e9297c9158"
      + port                  = 80
      + privacy               = "public"
      + protocol              = "http1"
      + region                = (known after apply)
      + registry_image        = "echarnus/clercq-it:latest"
      + sandbox               = (known after apply)
      + status                = (known after apply)
      + tags                  = [
          + "project=clercq-it",
          + "environment=portfolio",
          + "namespace=Portfolio",
        ]
      + timeout               = 30
    }

  # scaleway_rdb_database.portfolio_app_db will be created
  + resource "scaleway_rdb_database" "portfolio_app_db" {
      + id          = (known after apply)
      + instance_id = (known after apply)
      + managed     = (known after apply)
      + name        = "clercqit_portfolio"
      + owner       = (known after apply)
      + region      = (known after apply)
      + size        = (known after apply)
    }

  # scaleway_rdb_instance.portfolio_db will be created
  + resource "scaleway_rdb_instance" "portfolio_db" {
      + backup_same_region        = (known after apply)
      + backup_schedule_frequency = (known after apply)
      + backup_schedule_retention = (known after apply)
      + certificate               = (known after apply)
      + disable_backup            = false
      + endpoint_ip               = (known after apply)
      + endpoint_port             = (known after apply)
      + engine                    = "PostgreSQL-16"
      + id                        = (known after apply)
      + is_ha_cluster             = false
      + name                      = "portfolio-db"
      + node_type                 = "DB-DEV-S"
      + organization_id           = (known after apply)
      + password                  = (sensitive value)
      + project_id                = (known after apply)
      + read_replicas             = (known after apply)
      + region                    = "fr-par"
      + settings                  = (known after apply)
      + user_name                 = "clercqit_admin"
      + volume_size_in_gb         = (known after apply)
      + volume_type               = "lssd"
    }

  # scaleway_rdb_user.portfolio_app_user will be created
  + resource "scaleway_rdb_user" "portfolio_app_user" {
      + id          = (known after apply)
      + instance_id = (known after apply)
      + is_admin    = false
      + name        = "clercqit_user"
      + password    = (sensitive value)
      + region      = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + container_id           = (known after apply)
  + container_namespace_id = "fr-par/cc7ff8cc-65f0-4559-ba8d-42e9297c9158"
  + container_url          = (known after apply)
  + custom_domain_url      = ""
  + database_endpoint      = (sensitive value)
  + database_name          = "clercqit_portfolio"
  + database_port          = (known after apply)
  + infrastructure_summary = {
      + container = {
          + cpu       = "1000m"
          + max_scale = 1
          + memory    = "128MB"
          + min_scale = 0
          + name      = "clercq-it-app"
          + url       = (known after apply)
        }
      + database  = {
          + endpoint = (known after apply)
          + name     = "portfolio-db"
          + type     = "DB-DEV-S"
        }
      + namespace = {
          + id   = "fr-par/cc7ff8cc-65f0-4559-ba8d-42e9297c9158"
          + name = "portfolio"
        }
    }

Warning: Multiple variable sources detected, please make sure the right credentials are used

  with provider["registry.terraform.io/scaleway/scaleway"],
  on main.tf line 31, in provider "scaleway":
  31: provider "scaleway" {

Variable		AvailableSources						Using
SCW_DEFAULT_PROJECT_ID	Profile defined in provider{} block, Environment
variable	Environment variable
SCW_DEFAULT_REGION	Profile defined in provider{} block, Environment variable
Environment variable
SCW_DEFAULT_ZONE	Profile defined in provider{} block, Environment variable
Environment variable


Warning: Deprecated attribute

  on main.tf line 90, in resource "scaleway_container" "portfolio_app":
  90:     "DATABASE_CONNECTION_STRING" = "Host=${scaleway_rdb_instance.portfolio_db.endpoint_ip};Port=${scaleway_rdb_instance.portfolio_db.endpoint_port};Database=clercqit_portfolio;Username=clercqit_user;Password=${var.database_password}"

The attribute "endpoint_ip" is deprecated. Refer to the provider
documentation for details.

(and 11 more similar warnings elsewhere)

```

</details>

*Pushed by: @Copilot*